<!-- dflook/terraform-github-actions {"workspace":"tofuenv","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"d3c81bc8ea23982600cd5cb148849bbda657cb5c19b2b9c22de15cdea19632a1","plan_job_ref":"Job Test actions using target and replace #439 at https://github.com/dflook/terraform-github-actions/actions/runs/12453459388","plan_hash":"a489efa2aacc8f33ab35a3144b99a7b2aac03dffd74bfb9c4843c1742ce8776a","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __tofuenv__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "ehjyzckEHp" -> (known after apply)
!~  foreach = "T01COwcXDB" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #439](https://github.com/dflook/terraform-github-actions/actions/runs/12453459388)